# Pandas - Data Wrangling 101
## Cleaning, Transforming & Analyzing Real-World Data

## Setup
Import required libraries

In [55]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Display settings
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 120)

print(f"Pandas version: {pd.__version__}")
print(f"NumPy version: {np.__version__}")

Pandas version: 2.3.1
NumPy version: 2.0.2

---
# Part 1: Pandas Fundamentals

## 1.1 Series - One-Dimensional Data

In [56]:
# Create a Series with automatic index
temperatures = pd.Series([23, 25, 22, 24])
print("Series with automatic index:")
print(temperatures)
print(f"\nData type: {temperatures.dtype}")

Series with automatic index:
0    23
1    25
2    22
3    24
dtype: int64

Data type: int64

In [57]:
# Create a Series with custom index
temps = pd.Series([23, 25, 22, 24], 
                  index=['Mon', 'Tue', 'Wed', 'Thu'],
                  name='Temperature')
print("Series with custom index:")
print(temps)
print(f"\nIndex: {temps.index.tolist()}")
print(f"Values: {temps.values}")

Series with custom index:
Mon    23
Tue    25
Wed    22
Thu    24
Name: Temperature, dtype: int64

Index: ['Mon', 'Tue', 'Wed', 'Thu']
Values: [23 25 22 24]

In [58]:
# Accessing Series elements
print(f"Temperature on Monday: {temps['Mon']}")
print(f"Temperature on Tuesday (using .iloc): {temps.iloc[1]}")

Temperature on Monday: 23
Temperature on Tuesday (using .iloc): 25

## 1.2 DataFrame - Two-Dimensional Data

In [59]:
# Create a DataFrame from a dictionary
data = {
    'City': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Salvador'],
    'Population': [12.3, 6.7, 2.5, 2.9],
    'Area_km2': [1521, 1200, 331, 693]
}

df = pd.DataFrame(data)
print("DataFrame created from dictionary:")
print(df)

DataFrame created from dictionary:
             City  Population  Area_km2
0       São Paulo        12.3      1521
1  Rio de Janeiro         6.7      1200
2  Belo Horizonte         2.5       331
3        Salvador         2.9       693

In [60]:
# Add a calculated column
df['Density'] = df['Population'] / df['Area_km2'] * 1000  # people per km²
print("\nDataFrame with calculated density:")
print(df)

DataFrame with calculated density:
             City  Population  Area_km2   Density
0       São Paulo        12.3      1521  8.086785
1  Rio de Janeiro         6.7      1200  5.583333
2  Belo Horizonte         2.5       331  7.552870
3        Salvador         2.9       693  4.184704

## 1.3 Creating Sample Dataset for Examples

Let's create a realistic sales dataset to use throughout the notebook

In [61]:
# Create a sample sales dataset
np.random.seed(42)

n_records = 100
cities = ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Salvador', 'Brasília']
products = ['Laptop', 'Smartphone', 'Tablet', 'Desktop', 'Monitor']

# Generate sample data
sales_data = {
    'ID': range(1, n_records + 1),
    'Date': pd.date_range('2024-01-01', periods=n_records, freq='D'),
    'City': np.random.choice(cities, n_records),
    'Product': np.random.choice(products, n_records),
    'Sales': np.random.randint(500, 5000, n_records),
    'Quantity': np.random.randint(1, 10, n_records),
    'Cost': np.random.randint(200, 2500, n_records)
}

df_sales = pd.DataFrame(sales_data)

# Add some realistic issues for data cleaning examples
# Add some missing values
df_sales.loc[np.random.choice(df_sales.index, 5, replace=False), 'Sales'] = np.nan
df_sales.loc[np.random.choice(df_sales.index, 3, replace=False), 'City'] = np.nan

# Add some duplicates
df_sales = pd.concat([df_sales, df_sales.iloc[[5, 12, 23]]], ignore_index=True)

# Calculate profit
df_sales['Profit'] = df_sales['Sales'] - df_sales['Cost']

# Save to CSV for later use
df_sales.to_csv('sales_data.csv', index=False)

print(f"Created sample dataset with {len(df_sales)} records")
print(f"\nFirst few rows:")
df_sales.head(10)

Created sample dataset with 103 records

First few rows:

   ID       Date            City     Product   Sales  Quantity  Cost  Profit
0   1 2024-01-01        Salvador     Desktop   697.0         5  1831 -1134.0
1   2 2024-01-02        Brasília      Laptop  2430.0         7  1215  1215.0
2   3 2024-01-03  Belo Horizonte     Desktop  4082.0         1  1548  2534.0
3   4 2024-01-04        Brasília  Smartphone  1108.0         3   715   393.0
4   5 2024-01-05        Brasília      Laptop  3772.0         2   535  3237.0
5   6 2024-01-06  Rio de Janeiro     Monitor  1647.0         9  1982  -335.0
6   7 2024-01-07             NaN      Tablet  4782.0         6   696  4086.0
7   8 2024-01-08  Belo Horizonte     Desktop  3897.0         3  1095  2802.0
8   9 2024-01-09  Belo Horizonte      Tablet  3011.0         8  2407   604.0
9  10 2024-01-10        Brasília      Tablet  2294.0         8  1051  1243.0

## 1.4 Reading Data from Files

In [62]:
# Read CSV file
df = pd.read_csv('sales_data.csv')
print("Data loaded from CSV:")
print(df.head())

Data loaded from CSV:
   ID        Date            City     Product   Sales  Quantity  Cost  Profit
0   1  2024-01-01        Salvador     Desktop   697.0         5  1831 -1134.0
1   2  2024-01-02        Brasília      Laptop  2430.0         7  1215  1215.0
2   3  2024-01-03  Belo Horizonte     Desktop  4082.0         1  1548  2534.0
3   4  2024-01-04        Brasília  Smartphone  1108.0         3   715   393.0
4   5  2024-01-05        Brasília      Laptop  3772.0         2   535  3237.0

In [63]:
# Read CSV with custom options
df = pd.read_csv('sales_data.csv',
                 parse_dates=['Date'],      # Convert Date column to datetime
                 index_col='ID')            # Use ID as index

print("\nData loaded with custom options:")
print(df.head())
print(f"\nDate column type: {df['Date'].dtype}")

Data loaded with custom options:
         Date            City     Product   Sales  Quantity  Cost  Profit
ID
1  2024-01-01        Salvador     Desktop   697.0         5  1831 -1134.0
2  2024-01-02        Brasília      Laptop  2430.0         7  1215  1215.0
3  2024-01-03  Belo Horizonte     Desktop  4082.0         1  1548  2534.0
4  2024-01-04        Brasília  Smartphone  1108.0         3   715   393.0
5  2024-01-05        Brasília      Laptop  3772.0         2   535  3237.0

Date column type: datetime64[ns]

## 1.5 Basic Data Exploration

In [64]:
# Reset index for cleaner examples
df = df.reset_index()

# Shape of the DataFrame
print(f"Dataset shape (rows, columns): {df.shape}")
print(f"Number of rows: {len(df)}")
print(f"Number of columns: {len(df.columns)}")

Dataset shape (rows, columns): (103, 8)
Number of rows: 103
Number of columns: 8

In [65]:
# View first and last rows
print("First 5 rows:")
display(df.head())

print("\nLast 5 rows:")
display(df.tail())

First 5 rows:

   ID       Date            City     Product   Sales  Quantity  Cost  Profit
0   1 2024-01-01        Salvador     Desktop   697.0         5  1831 -1134.0
1   2 2024-01-02        Brasília      Laptop  2430.0         7  1215  1215.0
2   3 2024-01-03  Belo Horizonte     Desktop  4082.0         1  1548  2534.0
3   4 2024-01-04        Brasília  Smartphone  1108.0         3   715   393.0
4   5 2024-01-05        Brasília      Laptop  3772.0         2   535  3237.0

Last 5 rows:

      ID       Date            City  Product   Sales  Quantity  Cost  Profit
98    99 2024-04-08  Rio de Janeiro  Monitor  1639.0         5   710   929.0
99   100 2024-04-09       São Paulo  Desktop   690.0         4   416   274.0
100    6 2024-01-06  Rio de Janeiro  Monitor  1647.0         9  1982  -335.0
101   13 2024-01-13        Brasília  Monitor  1869.0         7  1768   101.0
102   24 2024-01-24       São Paulo   Tablet  3419.0         2  2282  1137.0

In [66]:
# Random sample
print("Random sample of 5 rows:")
df.sample(5)

Random sample of 5 rows:

    ID       Date            City  Product   Sales  Quantity  Cost  Profit
67  68 2024-03-08  Rio de Janeiro   Tablet  4996.0         7  1084  3912.0
32  33 2024-02-02        Salvador  Desktop  4223.0         3  1716  2507.0
43  44 2024-02-13  Rio de Janeiro  Desktop  4491.0         4  1887  2604.0
73  74 2024-03-14  Rio de Janeiro  Desktop  2193.0         6  1265   928.0
36  37 2024-02-06  Belo Horizonte  Desktop  3670.0         7  2092  1578.0

In [67]:
# DataFrame info
print("DataFrame information:")
df.info()

DataFrame information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103 entries, 0 to 102
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        103 non-null    int64
 1   Date      103 non-null    datetime64[ns]
 2   City      100 non-null    object
 3   Product   103 non-null    object
 4   Sales     98 non-null     float64
 5   Quantity  103 non-null    int64
 6   Cost      103 non-null    int64
 7   Profit    98 non-null     float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(2)
memory usage: 6.6+ KB

In [68]:
# Column names and data types
print("Column names:")
print(df.columns.tolist())

print("\nData types:")
print(df.dtypes)

Column names:
['ID', 'Date', 'City', 'Product', 'Sales', 'Quantity', 'Cost', 'Profit']

Data types:
ID                   int64
Date        datetime64[ns]
City                object
Product             object
Sales              float64
Quantity             int64
Cost                 int64
Profit             float64
dtype: object

## 1.6 Statistical Summary

In [69]:
# Statistical summary for numeric columns
print("Statistical summary:")
df.describe()

Statistical summary:

               ID                           Date        Sales    Quantity         Cost       Profit
count  103.000000                            103    98.000000  103.000000   103.000000    98.000000
mean    49.446602  2024-02-18 10:43:06.407767040  2725.602041    5.009709  1374.097087  1360.551020
min      1.000000            2024-01-01 00:00:00   516.000000    1.000000   211.000000 -1268.000000
25%     24.000000            2024-01-24 00:00:00  1641.000000    3.000000   922.500000   196.250000
50%     49.000000            2024-02-18 00:00:00  2791.000000    5.000000  1397.000000  1276.500000
75%     74.500000            2024-03-14 12:00:00  3730.250000    7.000000  1833.000000  2522.000000
max    100.000000            2024-04-09 00:00:00  4999.000000    9.000000  2464.000000  4292.000000
std     29.255376                            NaN  1298.298448    2.491142   611.067798  1399.334202

In [70]:
# Summary for all columns (including non-numeric)
print("Summary for all columns:")
df.describe(include='all')

Summary for all columns:

                ID                           Date      City Product        Sales    Quantity         Cost       Profit
count   103.000000                            103       100     103    98.000000  103.000000   103.000000    98.000000
unique         NaN                            NaN         5       5          NaN         NaN          NaN          NaN
top            NaN                            NaN  Salvador  Laptop          NaN         NaN          NaN          NaN
freq           NaN                            NaN        26      25          NaN         NaN          NaN          NaN
mean     49.446602  2024-02-18 10:43:06.407767040       NaN     NaN  2725.602041    5.009709  1374.097087  1360.551020
min       1.000000            2024-01-01 00:00:00       NaN     NaN   516.000000    1.000000   211.000000 -1268.000000
25%      24.000000            2024-01-24 00:00:00       NaN     NaN  1641.000000    3.000000   922.500000   196.250000
50%      49.000000            2024-02-18 00:00:00       NaN     NaN  2791.000000    5.000000  1397.000000  1276.500000
75%      74.500000            2024-03-14 12:00:00       NaN     NaN  3730.250000    7.000000  1833.000000  2522.000000
max     100.000000            2024-04-09 00:00:00       NaN     NaN  4999.000000    9.000000  2464.000000  4292.000000
std      29.255376                            NaN       NaN     NaN  1298.298448    2.491142   611.067798  1399.334202

In [71]:
# Value counts for categorical columns
print("City distribution:")
print(df['City'].value_counts())

print("\nProduct distribution:")
print(df['Product'].value_counts())

City distribution:
City
Salvador          26
Rio de Janeiro    21
Brasília          19
São Paulo         19
Belo Horizonte    15
Name: count, dtype: int64

Product distribution:
Product
Laptop        25
Desktop       23
Tablet        22
Monitor       19
Smartphone    14
Name: count, dtype: int64

In [72]:
# Unique values
print(f"Unique cities: {df['City'].unique()}")
print(f"Number of unique cities: {df['City'].nunique()}")
print(f"\nUnique products: {df['Product'].unique()}")
print(f"Number of unique products: {df['Product'].nunique()}")

Unique cities: ['Salvador' 'Brasília' 'Belo Horizonte' 'Rio de Janeiro' nan 'São Paulo']
Number of unique cities: 5

Unique products: ['Desktop' 'Laptop' 'Smartphone' 'Monitor' 'Tablet']
Number of unique products: 5

## 1.7 Indexing and Selection

In [73]:
# Select single column (returns Series)
print("Sales column (Series):")
print(df['Sales'].head())
print(f"Type: {type(df['Sales'])}")

Sales column (Series):
0     697.0
1    2430.0
2    4082.0
3    1108.0
4    3772.0
Name: Sales, dtype: float64
Type: <class 'pandas.core.series.Series'>

In [74]:
# Select multiple columns (returns DataFrame)
print("Multiple columns (DataFrame):")
print(df[['City', 'Product', 'Sales']].head())
print(f"Type: {type(df[['City', 'Sales']])}")

Multiple columns (DataFrame):
             City     Product   Sales
0        Salvador     Desktop   697.0
1        Brasília      Laptop  2430.0
2  Belo Horizonte     Desktop  4082.0
3        Brasília  Smartphone  1108.0
4        Brasília      Laptop  3772.0
Type: <class 'pandas.core.frame.DataFrame'>

In [75]:
# Select rows by position with iloc
print("First row:")
print(df.iloc[0])

print("\nFirst 5 rows:")
display(df.iloc[0:5])

print("\nSpecific rows:")
display(df.iloc[[0, 5, 10]])

First row:
ID                            1
Date        2024-01-01 00:00:00
City                   Salvador
Product                 Desktop
Sales                     697.0
Quantity                      5
Cost                       1831
Profit                  -1134.0
Name: 0, dtype: object

First 5 rows:

   ID       Date            City     Product   Sales  Quantity  Cost  Profit
0   1 2024-01-01        Salvador     Desktop   697.0         5  1831 -1134.0
1   2 2024-01-02        Brasília      Laptop  2430.0         7  1215  1215.0
2   3 2024-01-03  Belo Horizonte     Desktop  4082.0         1  1548  2534.0
3   4 2024-01-04        Brasília  Smartphone  1108.0         3   715   393.0
4   5 2024-01-05        Brasília      Laptop  3772.0         2   535  3237.0

Specific rows:

    ID       Date            City  Product   Sales  Quantity  Cost  Profit
0    1 2024-01-01        Salvador  Desktop   697.0         5  1831 -1134.0
5    6 2024-01-06  Rio de Janeiro  Monitor  1647.0         9  1982  -335.0
10  11 2024-01-11        Salvador   Laptop  1159.0         2  1887  -728.0

In [76]:
# Select rows and columns together
print("Rows 0-4, specific columns:")
df.loc[0:4, ['City', 'Product', 'Sales']]

Rows 0-4, specific columns:

             City     Product   Sales
0        Salvador     Desktop   697.0
1        Brasília      Laptop  2430.0
2  Belo Horizonte     Desktop  4082.0
3        Brasília  Smartphone  1108.0
4        Brasília      Laptop  3772.0

In [77]:
# Select specific cells
print("Cell at row 0, column 'Sales':")
print(df.loc[0, 'Sales'])

print("\nAlternative using iloc:")
print(df.iloc[0, df.columns.get_loc('Sales')])

Cell at row 0, column 'Sales':
697.0

Alternative using iloc:
697.0

---
# Part 2: Data Cleaning

## 2.1 Handling Missing Data

In [78]:
# Check for missing values
print("Missing values per column:")
print(df.isnull().sum())

print("\nPercentage of missing values:")
print((df.isnull().sum() / len(df)) * 100)

Missing values per column:
ID          0
Date        0
City        3
Product     0
Sales       5
Quantity    0
Cost        0
Profit      5
dtype: int64

Percentage of missing values:
ID          0.000000
Date        0.000000
City        2.912621
Product     0.000000
Sales       4.854369
Quantity    0.000000
Cost        0.000000
Profit      4.854369
dtype: float64

In [79]:
# Visualize missing data
print("Columns with missing data (sorted):")
missing = df.isnull().sum()
missing = missing[missing > 0].sort_values(ascending=False)
print(missing)

Columns with missing data (sorted):
Sales     5
Profit    5
City      3
dtype: int64

In [80]:
# View rows with missing values
print("Rows with any missing values:")
df[df.isnull().any(axis=1)]

Rows with any missing values:

    ID       Date            City  Product   Sales  Quantity  Cost  Profit
6    7 2024-01-07             NaN   Tablet  4782.0         6   696  4086.0
21  22 2024-01-22        Brasília  Desktop     NaN         7  1830     NaN
26  27 2024-01-27  Belo Horizonte  Monitor     NaN         7  1825     NaN
52  53 2024-02-22        Salvador   Laptop     NaN         4  2103     NaN
54  55 2024-02-24  Belo Horizonte   Tablet     NaN         4  1565     NaN
59  60 2024-02-29             NaN   Tablet  1456.0         2   595   861.0
79  80 2024-03-20        Salvador   Laptop     NaN         5   434     NaN
80  81 2024-03-21             NaN   Laptop  3567.0         6   950  2617.0

In [81]:
# Create a copy for cleaning
df_clean = df.copy()

# Fill numeric columns with mean
df_clean['Sales'] = df_clean['Sales'].fillna(df_clean['Sales'].mean())

# Fill categorical columns with mode (most frequent value)
if df_clean['City'].isnull().any():
    df_clean['City'] = df_clean['City'].fillna(df_clean['City'].mode()[0])

print("Missing values after filling:")
print(df_clean.isnull().sum())

Missing values after filling:
ID          0
Date        0
City        0
Product     0
Sales       0
Quantity    0
Cost        0
Profit      5
dtype: int64

In [82]:
# Alternative: Drop rows with missing values
df_dropped = df.dropna()
print(f"Original shape: {df.shape}")
print(f"Shape after dropping NaN: {df_dropped.shape}")
print(f"Rows removed: {len(df) - len(df_dropped)}")

Original shape: (103, 8)
Shape after dropping NaN: (95, 8)
Rows removed: 8

In [83]:
# Drop rows only if specific columns have NaN
df_selective = df.dropna(subset=['ID', 'Date'])
print(f"Shape after selective dropping: {df_selective.shape}")

Shape after selective dropping: (103, 8)

## 2.2 Removing Duplicates

In [84]:
# Check for duplicates
print(f"Number of duplicate rows: {df_clean.duplicated().sum()}")

if df_clean.duplicated().sum() > 0:
    print("\nDuplicate rows:")
    display(df_clean[df_clean.duplicated(keep=False)].sort_values('ID'))

Number of duplicate rows: 3

Duplicate rows:

     ID       Date            City  Product   Sales  Quantity  Cost  Profit
5     6 2024-01-06  Rio de Janeiro  Monitor  1647.0         9  1982  -335.0
100   6 2024-01-06  Rio de Janeiro  Monitor  1647.0         9  1982  -335.0
12   13 2024-01-13        Brasília  Monitor  1869.0         7  1768   101.0
101  13 2024-01-13        Brasília  Monitor  1869.0         7  1768   101.0
23   24 2024-01-24       São Paulo   Tablet  3419.0         2  2282  1137.0
102  24 2024-01-24       São Paulo   Tablet  3419.0         2  2282  1137.0

In [85]:
# Remove duplicates
print(f"Shape before removing duplicates: {df_clean.shape}")

df_clean = df_clean.drop_duplicates()

print(f"Shape after removing duplicates: {df_clean.shape}")
print(f"Duplicates removed: {df.shape[0] - df_clean.shape[0]}")

Shape before removing duplicates: (103, 8)
Shape after removing duplicates: (100, 8)
Duplicates removed: 3

In [86]:
# Remove duplicates based on specific columns
# For example, keep only one record per ID
df_unique_id = df_clean.drop_duplicates(subset=['ID'], keep='first')
print(f"Unique records by ID: {len(df_unique_id)}")

Unique records by ID: 100

## 2.3 Data Type Conversion

In [87]:
# Check current data types
print("Current data types:")
print(df_clean.dtypes)

Current data types:
ID                   int64
Date        datetime64[ns]
City                object
Product             object
Sales              float64
Quantity             int64
Cost                 int64
Profit             float64
dtype: object

In [88]:
# Convert to datetime if needed
if df_clean['Date'].dtype == 'object':
    df_clean['Date'] = pd.to_datetime(df_clean['Date'])
    print(f"Date column converted to: {df_clean['Date'].dtype}")

In [89]:
# Convert to category (saves memory for columns with repeated values)
df_clean['City'] = df_clean['City'].astype('category')
df_clean['Product'] = df_clean['Product'].astype('category')

print("Data types after conversion:")
print(df_clean.dtypes)

print(f"\nMemory usage before categorization: {df.memory_usage(deep=True).sum() / 1024:.2f} KB")
print(f"Memory usage after categorization: {df_clean.memory_usage(deep=True).sum() / 1024:.2f} KB")

Data types after conversion:
ID                   int64
Date        datetime64[ns]
City              category
Product           category
Sales              float64
Quantity             int64
Cost                 int64
Profit             float64
dtype: object

Memory usage before categorization: 19.34 KB
Memory usage after categorization: 6.71 KB

In [90]:
# Convert numeric columns (with error handling)
# Example: if we had a column with numbers stored as strings
df_clean['Sales'] = pd.to_numeric(df_clean['Sales'], errors='coerce')
print(f"Sales column type: {df_clean['Sales'].dtype}")

Sales column type: float64

## 2.4 String Operations

In [91]:
# Create a sample DataFrame with messy text data
messy_data = pd.DataFrame({
    'Name': ['  Ana Silva  ', 'PEDRO Santos', 'maria COSTA', '  João  Oliveira'],
    'Email': ['ana@example.com', 'PEDRO@EXAMPLE.COM', 'maria@Example.com', 'joao@example.COM'],
    'Phone': ['(11) 9999-8888', '11-98888-7777', '(21)97777-6666', '21 96666-5555']
})

print("Original messy data:")
display(messy_data)

Original messy data:

               Name              Email           Phone
0       Ana Silva      ana@example.com  (11) 9999-8888
1      PEDRO Santos  PEDRO@EXAMPLE.COM   11-98888-7777
2       maria COSTA  maria@Example.com  (21)97777-6666
3    João  Oliveira   joao@example.COM   21 96666-5555

In [92]:
# Clean string data
# Remove leading/trailing whitespace
messy_data['Name'] = messy_data['Name'].str.strip()

# Standardize to title case
messy_data['Name'] = messy_data['Name'].str.title()

# Standardize email to lowercase
messy_data['Email'] = messy_data['Email'].str.lower()

# Standardize phone format
messy_data['Phone'] = messy_data['Phone'].str.replace(r'[()\-\s]', '', regex=True)

print("\nCleaned data:")
display(messy_data)

Cleaned data:

             Name              Email        Phone
0       Ana Silva    ana@example.com   1199998888
1    Pedro Santos  pedro@example.com  11988887777
2     Maria Costa  maria@example.com  21977776666
3  João  Oliveira   joao@example.com  21966665555

In [93]:
# Other useful string operations
# Check if string contains pattern
print("Names containing 'Silva':")
print(messy_data[messy_data['Name'].str.contains('Silva')])

# Split strings
print("\nSplit names into first and last:")
messy_data[['First_Name', 'Last_Name']] = messy_data['Name'].str.split(' ', n=1, expand=True)
display(messy_data[['Name', 'First_Name', 'Last_Name']])

Names containing 'Silva':
        Name            Email       Phone
0  Ana Silva  ana@example.com  1199998888

Split names into first and last:

             Name First_Name  Last_Name
0       Ana Silva        Ana      Silva
1    Pedro Santos      Pedro     Santos
2     Maria Costa      Maria      Costa
3  João  Oliveira       João   Oliveira

---
# Part 3: Data Transformation

## 3.1 Filtering Data

In [94]:
# Simple filter - high sales
high_sales = df_clean[df_clean['Sales'] > 3000]
print(f"Records with sales > 3000: {len(high_sales)}")
print("\nSample:")
display(high_sales.head())

Records with sales > 3000: 45

Sample:

   ID       Date            City  Product   Sales  Quantity  Cost  Profit
2   3 2024-01-03  Belo Horizonte  Desktop  4082.0         1  1548  2534.0
4   5 2024-01-05        Brasília   Laptop  3772.0         2   535  3237.0
6   7 2024-01-07        Salvador   Tablet  4782.0         6   696  4086.0
7   8 2024-01-08  Belo Horizonte  Desktop  3897.0         3  1095  2802.0
8   9 2024-01-09  Belo Horizonte   Tablet  3011.0         8  2407   604.0

In [95]:
# Multiple conditions (AND)
filtered = df_clean[(df_clean['Sales'] > 2000) & (df_clean['City'] == 'São Paulo')]
print(f"São Paulo sales > 2000: {len(filtered)} records")
display(filtered.head())

São Paulo sales > 2000: 12 records

    ID       Date       City     Product   Sales  Quantity  Cost  Profit
18  19 2024-01-19  São Paulo      Laptop  2343.0         9  1266  1077.0
23  24 2024-01-24  São Paulo      Tablet  3419.0         2  2282  1137.0
24  25 2024-01-25  São Paulo      Laptop  2302.0         9   289  2013.0
33  34 2024-02-03  São Paulo     Monitor  3608.0         7   612  2996.0
38  39 2024-02-08  São Paulo  Smartphone  2755.0         3  1322  1433.0

In [96]:
# Multiple conditions (OR)
filtered = df_clean[(df_clean['Product'] == 'Laptop') | (df_clean['Product'] == 'Desktop')]
print(f"Laptop or Desktop sales: {len(filtered)} records")
print("\nProduct distribution:")
print(filtered['Product'].value_counts())

Laptop or Desktop sales: 48 records

Product distribution:
Product
Laptop        25
Desktop       23
Monitor        0
Smartphone     0
Tablet         0
Name: count, dtype: int64

In [97]:
# Using isin() for multiple values
cities_of_interest = ['São Paulo', 'Rio de Janeiro', 'Brasília']
filtered = df_clean[df_clean['City'].isin(cities_of_interest)]
print(f"Records from selected cities: {len(filtered)}")
print("\nCity distribution:")
print(filtered['City'].value_counts())

Records from selected cities: 56

City distribution:
City
Rio de Janeiro    20
São Paulo         18
Brasília          18
Belo Horizonte     0
Salvador           0
Name: count, dtype: int64

In [98]:
# NOT condition
not_rio = df_clean[~(df_clean['City'] == 'Rio de Janeiro')]
print(f"Records NOT from Rio: {len(not_rio)}")

# Alternative using isin with NOT
not_selected = df_clean[~df_clean['City'].isin(['Rio de Janeiro', 'Salvador'])]
print(f"Records NOT from Rio or Salvador: {len(not_selected)}")

Records NOT from Rio: 80
Records NOT from Rio or Salvador: 51

In [99]:
# Filter by date range
start_date = '2024-02-01'
end_date = '2024-02-29'
feb_sales = df_clean[(df_clean['Date'] >= start_date) & (df_clean['Date'] <= end_date)]
print(f"February sales records: {len(feb_sales)}")

February sales records: 29

## 3.2 Creating New Columns

In [100]:
# Simple calculation
df_clean['Sales_k'] = df_clean['Sales'] / 1000
print("Added Sales_k column (sales in thousands):")
display(df_clean[['Sales', 'Sales_k']].head())

Added Sales_k column (sales in thousands):

    Sales  Sales_k
0   697.0    0.697
1  2430.0    2.430
2  4082.0    4.082
3  1108.0    1.108
4  3772.0    3.772

In [101]:
# Conditional column using np.where
df_clean['Performance'] = np.where(df_clean['Sales'] > 2500, 'High', 'Low')
print("Performance distribution:")
print(df_clean['Performance'].value_counts())

Performance distribution:
Performance
High    57
Low     43
Name: count, dtype: int64

In [102]:
# Multiple conditions using np.select
conditions = [
    df_clean['Sales'] > 3500,
    df_clean['Sales'] > 2500,
    df_clean['Sales'] > 1500
]
choices = ['Excellent', 'Good', 'Average']
df_clean['Category'] = np.select(conditions, choices, default='Poor')

print("Category distribution:")
print(df_clean['Category'].value_counts().sort_index())

print("\nSample:")
display(df_clean[['Sales', 'Category']].head(10))

Category distribution:
Category
Average      23
Excellent    34
Good         23
Poor         20
Name: count, dtype: int64

Sample:

    Sales   Category
0   697.0       Poor
1  2430.0    Average
2  4082.0  Excellent
3  1108.0       Poor
4  3772.0  Excellent
5  1647.0    Average
6  4782.0  Excellent
7  3897.0  Excellent
8  3011.0       Good
9  2294.0    Average

In [103]:
# Extract date components
df_clean['Year'] = df_clean['Date'].dt.year
df_clean['Month'] = df_clean['Date'].dt.month
df_clean['Day'] = df_clean['Date'].dt.day
df_clean['DayOfWeek'] = df_clean['Date'].dt.day_name()

print("Date components extracted:")
display(df_clean[['Date', 'Year', 'Month', 'Day', 'DayOfWeek']].head())

Date components extracted:

        Date  Year  Month  Day  DayOfWeek
0 2024-01-01  2024      1    1     Monday
1 2024-01-02  2024      1    2    Tuesday
2 2024-01-03  2024      1    3  Wednesday
3 2024-01-04  2024      1    4   Thursday
4 2024-01-05  2024      1    5     Friday

## 3.3 Applying Functions

In [104]:
# Apply lambda function to single column
df_clean['Sales_with_tax'] = df_clean['Sales'].apply(lambda x: x * 1.15)
print("Sales with 15% tax:")
display(df_clean[['Sales', 'Sales_with_tax']].head())

Sales with 15% tax:

    Sales  Sales_with_tax
0   697.0          801.55
1  2430.0         2794.50
2  4082.0         4694.30
3  1108.0         1274.20
4  3772.0         4337.80

In [105]:
# Define custom function
def categorize_profit(profit):
    if pd.isna(profit):
        return 'Unknown'
    elif profit > 2000:
        return 'High Profit'
    elif profit > 1000:
        return 'Medium Profit'
    elif profit > 0:
        return 'Low Profit'
    else:
        return 'Loss'

df_clean['Profit_Category'] = df_clean['Profit'].apply(categorize_profit)

print("Profit category distribution:")
print(df_clean['Profit_Category'].value_counts())

Profit category distribution:
Profit_Category
High Profit      35
Low Profit       22
Medium Profit    20
Loss             18
Unknown           5
Name: count, dtype: int64

In [106]:
# Map values using dictionary
city_codes = {
    'São Paulo': 'SP',
    'Rio de Janeiro': 'RJ',
    'Belo Horizonte': 'BH',
    'Salvador': 'SA',
    'Brasília': 'BSB'
}

df_clean['City_Code'] = df_clean['City'].map(city_codes)

print("City codes mapped:")
display(df_clean[['City', 'City_Code']].drop_duplicates())

City codes mapped:

              City City_Code
0         Salvador        SA
1         Brasília       BSB
2   Belo Horizonte        BH
5   Rio de Janeiro        RJ
18       São Paulo        SP

In [107]:
# Apply function across rows (axis=1)
def calculate_margin(row):
    if row['Sales'] > 0:
        return (row['Profit'] / row['Sales']) * 100
    return 0

df_clean['Profit_Margin'] = df_clean.apply(calculate_margin, axis=1)

print("Profit margin calculated:")
display(df_clean[['Sales', 'Profit', 'Profit_Margin']].head())

Profit margin calculated:

    Sales  Profit  Profit_Margin
0   697.0 -1134.0    -162.697274
1  2430.0  1215.0      50.000000
2  4082.0  2534.0      62.077413
3  1108.0   393.0      35.469314
4  3772.0  3237.0      85.816543

## 3.4 Sorting Data

In [108]:
# Sort by single column (ascending)
sorted_df = df_clean.sort_values('Sales')
print("Sorted by Sales (ascending):")
display(sorted_df[['City', 'Product', 'Sales']].head())

Sorted by Sales (ascending):

         City     Product  Sales
83   Brasília  Smartphone  516.0
51   Salvador      Laptop  598.0
14   Salvador      Laptop  646.0
61   Salvador      Laptop  660.0
99  São Paulo     Desktop  690.0

In [109]:
# Sort descending
sorted_df = df_clean.sort_values('Sales', ascending=False)
print("Top 5 sales:")
display(sorted_df[['City', 'Product', 'Sales']].head())

Top 5 sales:

              City  Product   Sales
40        Salvador   Laptop  4999.0
67  Rio de Janeiro   Tablet  4996.0
62        Brasília  Monitor  4993.0
6         Salvador   Tablet  4782.0
94       São Paulo  Desktop  4776.0

In [110]:
# Sort by multiple columns
sorted_df = df_clean.sort_values(['City', 'Sales'], ascending=[True, False])
print("Sorted by City (asc) and Sales (desc):")
display(sorted_df[['City', 'Product', 'Sales']].head(10))

Sorted by City (asc) and Sales (desc):

              City  Product   Sales
34  Belo Horizonte   Tablet  4590.0
25  Belo Horizonte  Desktop  4561.0
30  Belo Horizonte   Tablet  4143.0
2   Belo Horizonte  Desktop  4082.0
92  Belo Horizonte  Desktop  3920.0
7   Belo Horizonte  Desktop  3897.0
36  Belo Horizonte  Desktop  3670.0
11  Belo Horizonte   Tablet  3311.0
89  Belo Horizonte   Tablet  3065.0
8   Belo Horizonte   Tablet  3011.0

In [111]:
# Sort and reset index
sorted_df = df_clean.sort_values('Date').reset_index(drop=True)
print("Sorted by date with reset index:")
display(sorted_df[['Date', 'City', 'Sales']].head())

Sorted by date with reset index:

        Date            City   Sales
0 2024-01-01        Salvador   697.0
1 2024-01-02        Brasília  2430.0
2 2024-01-03  Belo Horizonte  4082.0
3 2024-01-04        Brasília  1108.0
4 2024-01-05        Brasília  3772.0

## 3.5 Renaming Columns

In [112]:
# Rename specific columns
df_renamed = df_clean.rename(columns={
    'City': 'city_name',
    'Product': 'product_name',
    'Sales': 'sales_amount'
})

print("Renamed columns:")
print(df_renamed.columns.tolist())

Renamed columns:
['ID', 'Date', 'city_name', 'product_name', 'sales_amount', 'Quantity', 'Cost', 'Profit', 'Sales_k', 'Performance', 'Category', 'Year', 'Month', 'Day', 'DayOfWeek', 'Sales_with_tax', 'Profit_Category', 'City_Code', 'Profit_Margin']

In [113]:
# Clean all column names (lowercase with underscores)
df_renamed = df_clean.copy()
df_renamed.columns = df_renamed.columns.str.lower().str.replace(' ', '_')

print("Cleaned column names:")
print(df_renamed.columns.tolist())

Cleaned column names:
['id', 'date', 'city', 'product', 'sales', 'quantity', 'cost', 'profit', 'sales_k', 'performance', 'category', 'year', 'month', 'day', 'dayofweek', 'sales_with_tax', 'profit_category', 'city_code', 'profit_margin']

---
# Part 4: Aggregation & Grouping

## 4.1 GroupBy Basics

In [114]:
# Simple groupby with single aggregation
city_sales = df_clean.groupby('City')['Sales'].mean()
print("Average sales by city:")
print(city_sales.sort_values(ascending=False))

Average sales by city:
City
Belo Horizonte    3144.546939
Brasília          2848.922336
Rio de Janeiro    2661.500000
São Paulo         2634.888889
Salvador          2575.696692
Name: Sales, dtype: float64

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/1584182337.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  city_sales = df_clean.groupby('City')['Sales'].mean()

In [115]:
# Multiple aggregations using agg()
city_stats = df_clean.groupby('City')['Sales'].agg(['mean', 'sum', 'count', 'min', 'max'])
city_stats.columns = ['Average', 'Total', 'Count', 'Min', 'Max']
print("Sales statistics by city:")
display(city_stats.sort_values('Total', ascending=False))

Sales statistics by city:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/3895534984.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  city_stats = df_clean.groupby('City')['Sales'].agg(['mean', 'sum', 'count', 'min', 'max'])

                    Average         Total  Count    Min     Max
City
Salvador        2575.696692  74695.204082     29  598.0  4999.0
Rio de Janeiro  2661.500000  53230.000000     20  753.0  4996.0
Brasília        2848.922336  51280.602041     18  516.0  4993.0
São Paulo       2634.888889  47428.000000     18  690.0  4776.0
Belo Horizonte  3144.546939  47168.204082     15  801.0  4590.0

In [116]:
# Group by product
product_stats = df_clean.groupby('Product')['Sales'].agg(['mean', 'sum', 'count'])
product_stats.columns = ['Average_Sales', 'Total_Sales', 'Number_of_Sales']
print("Sales statistics by product:")
display(product_stats.sort_values('Total_Sales', ascending=False))

Sales statistics by product:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/1286607963.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  product_stats = df_clean.groupby('Product')['Sales'].agg(['mean', 'sum', 'count'])

            Average_Sales   Total_Sales  Number_of_Sales
Product
Desktop       3057.460958  70321.602041               23
Laptop        2720.128163  68003.204082               25
Tablet        3220.076288  67621.602041               21
Monitor       2584.035414  43928.602041               17
Smartphone    1709.071429  23927.000000               14

## 4.2 Advanced Aggregations

In [117]:
# Different aggregations for different columns
city_analysis = df_clean.groupby('City').agg({
    'Sales': ['mean', 'sum'],
    'Quantity': 'sum',
    'Profit': ['min', 'max', 'mean']
})

print("Multi-column aggregation by city:")
display(city_analysis)

Multi-column aggregation by city:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/2112395100.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  city_analysis = df_clean.groupby('City').agg({

                      Sales               Quantity  Profit
                       mean           sum      sum     min     max         mean
City
Belo Horizonte  3144.546939  47168.204082       72  -787.0  3662.0  1586.769231
Brasília        2848.922336  51280.602041       83  -881.0  3351.0  1510.705882
Rio de Janeiro  2661.500000  53230.000000      118 -1268.0  4292.0  1430.650000
Salvador        2575.696692  74695.204082      132 -1190.0  4086.0  1285.037037
São Paulo       2634.888889  47428.000000       93  -133.0  3681.0  1267.333333

In [118]:
# Group by multiple columns
city_product = df_clean.groupby(['City', 'Product'])['Sales'].agg(['mean', 'count'])
city_product.columns = ['Average_Sales', 'Count']
print("Sales by City and Product (top 10):")
display(city_product.sort_values('Average_Sales', ascending=False).head(10))

Sales by City and Product (top 10):

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/2637809595.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  city_product = df_clean.groupby(['City', 'Product'])['Sales'].agg(['mean', 'count'])

                        Average_Sales  Count
City           Product
Rio de Janeiro Tablet     4134.000000      4
Belo Horizonte Desktop    4026.000000      5
Brasília       Laptop     3445.800000      5
               Monitor    3431.000000      2
               Desktop    3330.801020      2
São Paulo      Monitor    3287.500000      4
Belo Horizonte Tablet     3135.943149      7
Salvador       Tablet     3119.000000      2
Brasília       Tablet     3035.400000      5
Salvador       Desktop    2900.500000      6

In [119]:
# Custom aggregation function
def sales_range(x):
    return x.max() - x.min()

city_range = df_clean.groupby('City')['Sales'].agg([
    ('Average', 'mean'),
    ('Range', sales_range),
    ('Count', 'count')
])

print("Sales range by city:")
display(city_range.sort_values('Range', ascending=False))

Sales range by city:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/3428851960.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  city_range = df_clean.groupby('City')['Sales'].agg([

                    Average   Range  Count
City
Brasília        2848.922336  4477.0     18
Salvador        2575.696692  4401.0     29
Rio de Janeiro  2661.500000  4243.0     20
São Paulo       2634.888889  4086.0     18
Belo Horizonte  3144.546939  3789.0     15

In [120]:
# Group by month
monthly_sales = df_clean.groupby(df_clean['Date'].dt.to_period('M')).agg({
    'Sales': ['sum', 'mean', 'count'],
    'Profit': 'sum'
})

print("Monthly sales analysis:")
display(monthly_sales)

Monthly sales analysis:

                Sales                      Profit
                  sum         mean count      sum
Date
2024-01  79524.204082  2565.296906    31  38466.0
2024-02  90509.204082  3121.007037    29  45422.0
2024-03  83140.602041  2681.954905    31  40193.0
2024-04  20628.000000  2292.000000     9   8350.0

## 4.3 Pivot Tables

In [121]:
# Simple pivot table
pivot = pd.pivot_table(df_clean,
                       values='Sales',
                       index='City',
                       columns='Product',
                       aggfunc='mean')

print("Average sales by City and Product:")
display(pivot.round(2))

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/3743104437.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot = pd.pivot_table(df_clean,

Average sales by City and Product:

Product         Desktop   Laptop  Monitor  Smartphone   Tablet
City
Belo Horizonte   4026.0      NaN   2725.6     1180.50  3135.94
Brasília         3330.8  3445.80   3431.0     1337.75  3035.40
Rio de Janeiro   2668.5  1499.50   2478.6     1763.67  4134.00
Salvador         2900.5  2756.17   1759.6     2142.00  3119.00
São Paulo        2529.0  2389.00   3287.5     2249.00  2573.00

In [122]:
# Pivot table with totals
pivot_totals = pd.pivot_table(df_clean,
                              values='Sales',
                              index='City',
                              columns='Product',
                              aggfunc='sum',
                              margins=True,
                              margins_name='Total')

print("Total sales by City and Product (with margins):")
display(pivot_totals)

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/917069681.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_totals = pd.pivot_table(df_clean,

Total sales by City and Product (with margins):

Product              Desktop        Laptop       Monitor  Smartphone        Tablet          Total
City
Belo Horizonte  20130.000000      0.000000   2725.602041      2361.0  21951.602041   47168.204082
Brasília         6661.602041  17229.000000   6862.000000      5351.0  15177.000000   51280.602041
Rio de Janeiro  16011.000000   2999.000000  12393.000000      5291.0  16536.000000   53230.000000
Salvador        17403.000000  35830.204082   8798.000000      6426.0   6238.000000   74695.204082
São Paulo       10116.000000  11945.000000  13150.000000      4498.0   7719.000000   47428.000000
Total           70321.602041  68003.204082  43928.602041     23927.0  67621.602041  273802.010204

In [123]:
# Multiple aggregations in pivot table
pivot_multi = pd.pivot_table(df_clean,
                             values='Sales',
                             index='City',
                             aggfunc=['sum', 'mean', 'count'])

print("Multiple aggregations by City:")
display(pivot_multi)

Multiple aggregations by City:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/2007863004.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_multi = pd.pivot_table(df_clean,
/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/2007863004.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_multi = pd.pivot_table(df_clean,
/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/2007863004.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_multi = pd.pivot_table(df_clean,

                         sum         mean count
                       Sales        Sales Sales
City
Belo Horizonte  47168.204082  3144.546939    15
Brasília        51280.602041  2848.922336    18
Rio de Janeiro  53230.000000  2661.500000    20
Salvador        74695.204082  2575.696692    29
São Paulo       47428.000000  2634.888889    18

In [124]:
# Pivot table by month
df_clean['Month_Name'] = df_clean['Date'].dt.month_name()

monthly_pivot = pd.pivot_table(df_clean,
                               values='Sales',
                               index='City',
                               columns='Month_Name',
                               aggfunc='sum',
                               fill_value=0)

print("Sales by City and Month:")
display(monthly_pivot)

Sales by City and Month:

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/292294863.py:4: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  monthly_pivot = pd.pivot_table(df_clean,

Month_Name       April      February       January         March
City
Belo Horizonte  5827.0  10985.602041  25730.602041   4625.000000
Brasília        3670.0  12622.000000  16432.602041  18556.000000
Rio de Janeiro  2838.0  17479.000000  12090.000000  20823.000000
Salvador           0.0  33146.602041  17207.000000  24341.602041
São Paulo       8293.0  16276.000000   8064.000000  14795.000000

---
# Part 5: Combining Datasets

## 5.1 Concatenating DataFrames

In [125]:
# Create sample datasets to combine
# Simulate January and February data
jan_data = df_clean[df_clean['Month'] == 1].head(10)
feb_data = df_clean[df_clean['Month'] == 2].head(10)

print(f"January records: {len(jan_data)}")
print(f"February records: {len(feb_data)}")

January records: 10
February records: 10

In [126]:
# Vertical concatenation (stacking rows)
combined = pd.concat([jan_data, feb_data], ignore_index=True)

print(f"Combined records: {len(combined)}")
print("\nFirst few rows:")
display(combined[['Date', 'City', 'Product', 'Sales']].head())
print("\nLast few rows:")
display(combined[['Date', 'City', 'Product', 'Sales']].tail())

Combined records: 20

First few rows:

        Date            City     Product   Sales
0 2024-01-01        Salvador     Desktop   697.0
1 2024-01-02        Brasília      Laptop  2430.0
2 2024-01-03  Belo Horizonte     Desktop  4082.0
3 2024-01-04        Brasília  Smartphone  1108.0
4 2024-01-05        Brasília      Laptop  3772.0

Last few rows:

         Date            City     Product   Sales
15 2024-02-06  Belo Horizonte     Desktop  3670.0
16 2024-02-07        Brasília  Smartphone  2182.0
17 2024-02-08       São Paulo  Smartphone  2755.0
18 2024-02-09  Rio de Janeiro     Monitor  1654.0
19 2024-02-10        Salvador      Laptop  4999.0

In [127]:
# Horizontal concatenation (stacking columns)
sales_data = df_clean[['ID', 'Sales', 'Quantity']].head(5)
cost_data = df_clean[['Cost', 'Profit']].head(5)

combined_cols = pd.concat([sales_data, cost_data], axis=1)
print("Horizontally concatenated data:")
display(combined_cols)

Horizontally concatenated data:

   ID   Sales  Quantity  Cost  Profit
0   1   697.0         5  1831 -1134.0
1   2  2430.0         7  1215  1215.0
2   3  4082.0         1  1548  2534.0
3   4  1108.0         3   715   393.0
4   5  3772.0         2   535  3237.0

## 5.2 Merging DataFrames

In [128]:
# Create sample datasets for merging
customers = pd.DataFrame({
    'Customer_ID': [1, 2, 3, 4],
    'Name': ['Ana Silva', 'Bruno Costa', 'Carla Santos', 'Daniel Oliveira'],
    'City': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Salvador']
})

orders = pd.DataFrame({
    'Order_ID': [101, 102, 103, 104, 105],
    'Customer_ID': [1, 2, 1, 5, 3],
    'Amount': [1500, 2300, 1800, 3200, 1200]
})

print("Customers:")
display(customers)
print("\nOrders:")
display(orders)

Customers:

   Customer_ID             Name            City
0            1        Ana Silva       São Paulo
1            2      Bruno Costa  Rio de Janeiro
2            3     Carla Santos  Belo Horizonte
3            4  Daniel Oliveira        Salvador

Orders:

   Order_ID  Customer_ID  Amount
0       101            1    1500
1       102            2    2300
2       103            1    1800
3       104            5    3200
4       105            3    1200

In [129]:
# Inner join (default) - only matching records
inner_merge = pd.merge(customers, orders, on='Customer_ID')
print("Inner Join (only matching customers):")
display(inner_merge)

Inner Join (only matching customers):

   Customer_ID          Name            City  Order_ID  Amount
0            1     Ana Silva       São Paulo       101    1500
1            1     Ana Silva       São Paulo       103    1800
2            2   Bruno Costa  Rio de Janeiro       102    2300
3            3  Carla Santos  Belo Horizonte       105    1200

In [130]:
# Left join - all customers, matching orders
left_merge = pd.merge(customers, orders, on='Customer_ID', how='left')
print("Left Join (all customers):")
display(left_merge)

Left Join (all customers):

   Customer_ID             Name            City  Order_ID  Amount
0            1        Ana Silva       São Paulo     101.0  1500.0
1            1        Ana Silva       São Paulo     103.0  1800.0
2            2      Bruno Costa  Rio de Janeiro     102.0  2300.0
3            3     Carla Santos  Belo Horizonte     105.0  1200.0
4            4  Daniel Oliveira        Salvador       NaN     NaN

In [131]:
# Right join - all orders, matching customers
right_merge = pd.merge(customers, orders, on='Customer_ID', how='right')
print("Right Join (all orders):")
display(right_merge)

Right Join (all orders):

   Customer_ID          Name            City  Order_ID  Amount
0            1     Ana Silva       São Paulo       101    1500
1            2   Bruno Costa  Rio de Janeiro       102    2300
2            1     Ana Silva       São Paulo       103    1800
3            5           NaN             NaN       104    3200
4            3  Carla Santos  Belo Horizonte       105    1200

In [132]:
# Outer join - all records from both
outer_merge = pd.merge(customers, orders, on='Customer_ID', how='outer')
print("Outer Join (all records from both):")
display(outer_merge)

Outer Join (all records from both):

   Customer_ID             Name            City  Order_ID  Amount
0            1        Ana Silva       São Paulo     101.0  1500.0
1            1        Ana Silva       São Paulo     103.0  1800.0
2            2      Bruno Costa  Rio de Janeiro     102.0  2300.0
3            3     Carla Santos  Belo Horizonte     105.0  1200.0
4            4  Daniel Oliveira        Salvador       NaN     NaN
5            5              NaN             NaN     104.0  3200.0

In [133]:
# Merge with different column names
customers2 = customers.rename(columns={'Customer_ID': 'ID'})

merge_diff_cols = pd.merge(customers2, orders, 
                           left_on='ID', 
                           right_on='Customer_ID')
print("Merge with different column names:")
display(merge_diff_cols)

Merge with different column names:

   ID          Name            City  Order_ID  Customer_ID  Amount
0   1     Ana Silva       São Paulo       101            1    1500
1   1     Ana Silva       São Paulo       103            1    1800
2   2   Bruno Costa  Rio de Janeiro       102            2    2300
3   3  Carla Santos  Belo Horizonte       105            3    1200

## 5.3 Real-World Example: Combining Sales with Product Info

In [138]:
# Create product information table
product_info = pd.DataFrame({
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Desktop', 'Monitor'],
    'Product_Category': ['Computer', 'Mobile', 'Mobile', 'Computer', 'Accessory'],
    'Brand': ['Dell', 'Samsung', 'Apple', 'HP', 'LG'],
    'Weight_kg': [2.5, 0.2, 0.5, 8.0, 4.5]
})

print("Product information:")
display(product_info)

Product information:

      Product Product_Category    Brand  Weight_kg
0      Laptop         Computer     Dell        2.5
1  Smartphone           Mobile  Samsung        0.2
2      Tablet           Mobile    Apple        0.5
3     Desktop         Computer       HP        8.0
4     Monitor        Accessory       LG        4.5

In [140]:
# Merge sales data with product information
sales_enriched = pd.merge(df_clean, product_info, on='Product', how='left')

print("Sales data enriched with product info:")
display(sales_enriched[['Date', 'City', 'Product', 'Sales', 'Product_Category', 'Brand']].head(10))

Sales data enriched with product info:

        Date            City     Product   Sales Product_Category    Brand
0 2024-01-01        Salvador     Desktop   697.0         Computer       HP
1 2024-01-02        Brasília      Laptop  2430.0         Computer     Dell
2 2024-01-03  Belo Horizonte     Desktop  4082.0         Computer       HP
3 2024-01-04        Brasília  Smartphone  1108.0           Mobile  Samsung
4 2024-01-05        Brasília      Laptop  3772.0         Computer     Dell
5 2024-01-06  Rio de Janeiro     Monitor  1647.0        Accessory       LG
6 2024-01-07        Salvador      Tablet  4782.0           Mobile    Apple
7 2024-01-08  Belo Horizonte     Desktop  3897.0         Computer       HP
8 2024-01-09  Belo Horizonte      Tablet  3011.0           Mobile    Apple
9 2024-01-10        Brasília      Tablet  2294.0           Mobile    Apple

In [141]:
# Analyze by category
category_analysis = sales_enriched.groupby('Product_Category').agg({
    'Sales': ['sum', 'mean', 'count'],
    'Profit': 'sum'
})

print("Sales analysis by product category:")
display(category_analysis)

Sales analysis by product category:

                          Sales                      Profit
                            sum         mean count      sum
Product_Category
Accessory          43928.602041  2584.035414    17  18292.0
Computer          138324.806122  2881.766794    48  70595.0
Mobile             91548.602041  2615.674344    35  43544.0

---
# Summary & Best Practices

## Complete Data Wrangling Workflow Example

In [142]:
# Step-by-step complete workflow
print("=== COMPLETE DATA WRANGLING WORKFLOW ===")

# 1. Load Data
print("\n1. LOADING DATA")
df_workflow = pd.read_csv('sales_data.csv', parse_dates=['Date'])
print(f"   Loaded {len(df_workflow)} records")

# 2. Explore
print("\n2. EXPLORING DATA")
print(f"   Shape: {df_workflow.shape}")
print(f"   Columns: {df_workflow.columns.tolist()}")
print(f"   Missing values:\n{df_workflow.isnull().sum()}")

# 3. Clean
print("\n3. CLEANING DATA")
initial_rows = len(df_workflow)
df_workflow = df_workflow.drop_duplicates()
print(f"   Removed {initial_rows - len(df_workflow)} duplicates")

df_workflow['Sales'].fillna(df_workflow['Sales'].mean(), inplace=True)
df_workflow['City'].fillna(df_workflow['City'].mode()[0], inplace=True)
print(f"   Filled missing values")

# 4. Transform
print("\n4. TRANSFORMING DATA")
df_workflow['Profit'] = df_workflow['Sales'] - df_workflow['Cost']
df_workflow['Month'] = df_workflow['Date'].dt.month
df_workflow['Quarter'] = df_workflow['Date'].dt.quarter
print(f"   Added calculated columns")

# 5. Aggregate
print("\n5. AGGREGATING DATA")
summary = df_workflow.groupby('City').agg({
    'Sales': ['sum', 'mean'],
    'Profit': 'sum'
})
print("   Created summary by City")
display(summary)

# 6. Save results
print("\n6. SAVING RESULTS")
df_workflow.to_csv('sales_data_cleaned.csv', index=False)
summary.to_csv('sales_summary.csv')
print("   Saved cleaned data and summary")

=== COMPLETE DATA WRANGLING WORKFLOW ===

1. LOADING DATA
   Loaded 103 records

2. EXPLORING DATA
   Shape: (103, 8)
   Columns: ['ID', 'Date', 'City', 'Product', 'Sales', 'Quantity', 'Cost', 'Profit']
   Missing values:
ID          0
Date        0
City        3
Product     0
Sales       5
Quantity    0
Cost        0
Profit      5
dtype: int64

3. CLEANING DATA
   Removed 3 duplicates
   Filled missing values

4. TRANSFORMING DATA
   Added calculated columns

5. AGGREGATING DATA
   Created summary by City

/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/1444878260.py:21: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_workflow['Sales'].fillna(df_workflow['Sales'].mean(), inplace=True)
/var/folders/p_/4lwv9j6s7d3_261gnt38kvh00000gn/T/ipykernel_12165/1444878260.py:22: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_workflow['City'].fillna(df_workflow['City'].mode()[0], inplace=True)

                       Sales                     Profit
                         sum         mean           sum
City
Belo Horizonte  47194.347368  3146.289825  22715.347368
Brasília        51293.673684  2849.648538  26590.673684
Rio de Janeiro  53230.000000  2661.500000  28613.000000
Salvador        74721.347368  2576.598185  37636.347368
São Paulo       47428.000000  2634.888889  22812.000000

6. SAVING RESULTS
   Saved cleaned data and summary

# Pandas Data Wrangling Exercise (40 minutes)

## Overview
This hands-on exercise will guide you through a realistic data analysis scenario using Pandas. You'll work with a messy sales dataset and apply data wrangling techniques to clean, transform, and analyze it.

---

## Setup (2 minutes)
```python
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Set random seed for reproducibility
np.random.seed(42)
```

---

## Part 1: Data Loading and Initial Exploration (8 minutes)

### Exercise 1.1: Create a Messy Dataset (provided)

Run this code to create your dataset:
```python
# Create a realistic messy dataset
data = {
    'order_id': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010,
                 1011, 1012, 1003, 1014, 1015, 1016, 1017, 1018, 1019, 1020],
    'date': ['2024-01-15', '2024-01-16', '2024-01-16', '2024-01-17', '2024-01-17',
             '2024-01-18', '2024-01-19', '2024-01-19', '2024-01-20', '2024-01-21',
             '2024-01-21', '2024-01-22', '2024-01-16', '2024-01-23', '2024-01-23',
             '2024-01-24', '2024-01-25', '2024-01-25', '2024-01-26', '2024-01-27'],
    'customer': ['Ana Silva', 'PEDRO SANTOS', 'maria costa', 'Ana Silva', 'João Oliveira',
                 'Pedro Santos', 'Maria Costa', 'Carlos Souza', 'Ana Silva', 'Pedro Santos',
                 'Fernanda Lima', 'João Oliveira', 'maria costa', 'Carlos Souza', 'Ana Silva',
                 'Fernanda Lima', 'Pedro Santos', 'João Oliveira', 'Maria Costa', 'Carlos Souza'],
    'product': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Laptop',
                'Keyboard', 'Mouse', 'Monitor', 'Laptop', 'Keyboard',
                'Monitor', 'Mouse', 'Keyboard', 'Laptop', 'Monitor',
                'Mouse', 'Keyboard', 'Laptop', 'Monitor', 'Mouse'],
    'quantity': [1, 2, 1, 1, 2, 3, 1, 1, 1, 2, 1, 4, 1, 1, 2, 3, 1, 1, 1, 2],
    'price': ['1500.00', '25.50', '89.90', '450.00', '1500.00',
              '89.90', '25.50', 'NA', '1500.00', '89.90',
              '450.00', '25.50', '89.90', '1500.00', '450.00',
              '25.50', '89.90', '1500.00', '450.00', '25.50'],
    'discount': [0.1, 0, 0.05, 0, 0.1, 0.05, 0, np.nan, 0.1, 0.05, 0, 0, 0.05, 0.1, 0, 0, 0.05, 0.1, 0, 0],
    'city': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'São Paulo', 'Belo Horizonte',
             'rio de janeiro', 'São Paulo', 'Salvador', 'São Paulo', 'Rio de Janeiro',
             'Brasília', 'Belo Horizonte', 'São Paulo', 'Salvador', 'São Paulo',
             'Brasília', 'Rio de Janeiro', 'Belo Horizonte', 'São Paulo', 'Salvador']
}

df = pd.DataFrame(data)
```

### Exercise 1.2: Initial Exploration (3 minutes)

**Tasks:**
1. Display the first 10 rows
2. Check the shape of the DataFrame
3. Display column names and data types
4. Get a summary with `.info()`

**Questions to answer:**
- How many rows and columns?
- What data type is the 'price' column? (Should it be this type?)
- What data type is the 'date' column? (Should it be this type?)

### Exercise 1.3: Statistical Summary (2 minutes)

**Tasks:**
1. Use `.describe()` to get statistics
2. Use `.describe(include='all')` to see all columns

**Questions:**
- What's the average quantity?
- How many unique customers are there?
- What's the most frequent product?

---

## Part 2: Data Cleaning (15 minutes)

### Exercise 2.1: Fix Data Types (4 minutes)

**Tasks:**
1. Convert the 'date' column to datetime type
2. Convert the 'price' column to float (hint: 'NA' string needs handling)
3. Verify the conversions worked

**Hints:**
```python
# For date
df['date'] = pd.to_datetime(df['date'])

# For price (handle 'NA')
df['price'] = pd.to_numeric(df['price'], errors='coerce')
```

**Question:** How many NaN values are in the price column now?

### Exercise 2.2: Handle Missing Data (4 minutes)

**Tasks:**
1. Find how many missing values are in each column
2. For the 'price' column: fill missing values with the median price for that product
3. For the 'discount' column: fill missing values with 0
4. Verify there are no more missing values

**Hints:**
```python
# Check missing values
df.isnull().sum()

# Fill discount
df['discount'] = df['discount'].fillna(0)

# For price, you'll need groupby:
# df['price'] = df.groupby('product')['price'].transform(lambda x: x.fillna(x.median()))
```

### Exercise 2.3: Remove Duplicates (3 minutes)

**Tasks:**
1. Check for duplicate rows
2. Identify which order_id is duplicated
3. Remove duplicate rows (keep first occurrence)
4. Verify duplicates are gone

**Question:** How many duplicates were removed?

### Exercise 2.4: Clean Text Data (4 minutes)

**Tasks:**
1. Standardize the 'customer' column to title case (e.g., "Ana Silva")
2. Standardize the 'city' column to title case (e.g., "Rio De Janeiro")
3. Display unique values to verify

**Hints:**
```python
df['customer'] = df['customer'].str.title()
df['city'] = df['city'].str.title()
```

**Question:** How many unique customers are there after cleaning?

---

## Part 3: Data Transformation (10 minutes)

### Exercise 3.1: Create Calculated Columns (3 minutes)

**Tasks:**
1. Create a 'subtotal' column: quantity × price
2. Create a 'total' column: subtotal × (1 - discount)
3. Create a 'revenue' column (same as total)

**Verification:** The total for order_id 1001 should be 1350.00

### Exercise 3.2: Extract Date Components (2 minutes)

**Tasks:**
1. Create a 'month' column from the date
2. Create a 'day_of_week' column (name, like "Monday")
3. Create a 'week' column (week number of the year)

**Hints:**
```python
df['month'] = df['date'].dt.month
df['day_of_week'] = df['date'].dt.day_name()
df['week'] = df['date'].dt.isocalendar().week
```

### Exercise 3.3: Categorize Data (2 minutes)

**Tasks:**
1. Create a 'price_category' column with these rules:
   - 'Low' if price < 50
   - 'Medium' if 50 ≤ price < 500
   - 'High' if price ≥ 500

**Hint:**
```python
df['price_category'] = pd.cut(df['price'], 
                               bins=[0, 50, 500, float('inf')],
                               labels=['Low', 'Medium', 'High'])
```

### Exercise 3.4: Create Customer Segments (3 minutes)

**Tasks:**
1. Calculate total spending per customer (sum of 'total' column)
2. Create a 'customer_segment' column:
   - 'VIP' if total spending > 3000
   - 'Regular' if 1000 ≤ total spending ≤ 3000
   - 'New' if total spending < 1000

**Hint:** You'll need to:
1. Use `groupby` to calculate total per customer
2. Merge back to the original dataframe
3. Use `np.where` or `pd.cut` to create categories

---

## Part 4: Data Analysis (5 minutes)

### Exercise 4.1: Aggregations (2 minutes)

**Tasks:**
1. Calculate total revenue by product
2. Calculate average order value by city
3. Find the customer with the highest total spending

**Questions:**
- Which product generated the most revenue?
- Which city has the highest average order value?
- Who is the top customer?

### Exercise 4.2: Grouping and Pivoting (3 minutes)

**Tasks:**
1. Create a pivot table showing total revenue by city and product
2. Find which product is most popular (by quantity) in each city
3. Calculate the average discount by product

**Hint for pivot table:**
```python
pivot = pd.pivot_table(df, 
                       values='revenue',
                       index='city',
                       columns='product',
                       aggfunc='sum')
```

**Questions:**
- Which city-product combination has the highest revenue?
- What's the average discount for Laptops?

---

## Bonus Challenges (if time permits)

### Bonus 1: Time Series Analysis
**Task:** Calculate daily revenue and plot it over time

### Bonus 2: Customer Analysis
**Task:** Find customers who bought more than one type of product

### Bonus 3: Advanced Filtering
**Task:** Find all orders where:
- Revenue > 1000 AND
- Discount > 0 AND
- City is São Paulo

### Bonus 4: Data Export
**Task:** Save the cleaned dataset to a new CSV file

---

## Solution Verification

At the end, your cleaned DataFrame should have:
- **No missing values**
- **No duplicates**
- **Standardized text** (title case for names and cities)
- **Correct data types** (datetime for dates, float for prices)
- **Additional columns:** subtotal, total, revenue, month, day_of_week, week, price_category, customer_segment

**Expected number of rows after cleaning:** 19 (one duplicate removed)

**Expected columns:** 15 (original 8 + 7 new ones)